#include <stdio.h>

int main() {
    int episode_number;

    printf("Введіть номер серії: ");
    scanf("%d", &episode_number);

    // Використання конструкції switch...case для вибору серії
    switch (episode_number) {
        case 1:
            printf("Наследники Дракона\nДата прем'єри: 21 листопада 2022 року\n");
            break;
        case 2:
            printf("Порочный принц\nДата прем'єри: 28 листопада 2022 року\n");
            break;
        case 3:
            printf("Второй своего имени\nДата прем'єри: 5 грудня 2022 року\n");
            break;
        case 4:
            printf("Король Узкого моря\nДата прем'єри: 12 грудня 2022 року\n");
            break;
        case 5:
            printf("Мы путь осветим\nДата прем'єри: 18 сентября 2022\n");
            break;
      case 6:
          printf("Принцесса и королева\nДата прем'єри: 25 сентября 2022 року\n");
          break;
      case 7:
          printf("Дрифтмарк\nДата прем'єри: 2 октября 2022\n");
          break;
      case 8:
          printf("Назва: Лорд Приливов\nДата прем'єри: 9 октября 2022 року\n");
          break;
      case 9:
          printf("Назва: Зелёный совет\nДата прем'єри: 16 октября 2022 року\n");
          break;
      case 10:
          printf("Назва: Чёрная королева\nДата прем'єри: 23 октября 2022 року\n");
          break;
        default:
            printf("Серії з таким номером не існує.\n");
            break;
    }

    return 0;
}
