#include <stdio.h>

int main() {
    float x1, y1, x2, y2, x3, y3;

    printf("Введіть координати точки 1 (x1, y1): ");
    scanf("%f %f", &x1, &y1);
    printf("Введіть координати точки 2 (x2, y2): ");
    scanf("%f %f", &x2, &y2);
    printf("Введіть координати точки 3 (x3, y3): ");
    scanf("%f %f", &x3, &y3);

    // Перевірка чи всі три точки лежать на одній прямій
    if ((y2 - y1) * (x3 - x2) == (y3 - y2) * (x2 - x1)) {
        printf("Три точки лежать на одній прямій.\n");
    } else {
        printf("Три точки не лежать на одній прямій.\n");
    }

    return 0;
}
